src/cf/Enums/ВидыЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыЦенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмуществоСУчетомНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандировочныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентРеализацияИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентИностранцы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентКомитент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыНезавершенногоСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПосредническиеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботыИУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРПодрядные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРСобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммыСвязанныеСРасчетамиПоОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежиОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыУслугиКомитентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныйСоюз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНесырьевые</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыАгентскихДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыАгентскихДоговоров</Name>
			<Comment>Виды договоров, согласно которым организация выступает в качестве налогового агента</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
					<Comment>Договор аренды муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияИмущества</Name>
					<Comment>Договор покупки государственного или муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерезидент</Name>
					<Comment>Договор с контрагентом (иностранной компанией) не являющимся плательщиком НДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НерезидентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыЦенностей/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает вид ценности, соответствующий виду переданного договора налогового агента.
// Параметры
//     ВидАгентскогоДоговора - ПеречислениеСсылка.ВидыАгентскихДоговоров.
// Возвращаемое значение:
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
Функция ВидЦенностиПоВидуАгентскогоДоговора(ВидАгентскогоДоговора) Экспорт
	
	Если ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Аренда Тогда
		Возврат Перечисления.ВидыЦенностей.НалоговыйАгентАренда;
	ИначеЕсли ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.РеализацияИмущества Тогда
		Возврат Перечисления.ВидыЦенностей.НалоговыйАгентРеализацияИмущества;
	ИначеЕсли ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Нерезидент Тогда 
		Возврат Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы;
	ИначеЕсли ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги Тогда
		Возврат Перечисления.ВидыЦенностей.НалоговыйАгентЭлектронныеУслуги;
	КонецЕсли;
	
КонецФункции

// Определяет, относится ли переданный вид ценности к операциям налогового агента по НДС.
// Параметры
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
// Возвращаемое значение: 
//     Булево - Истина - вид ценности относится к операциям налогового агента по НДС,
//              Ложь - вид ценности не относится к операциям налогового агента по НДС.
Функция ЭтоНалоговыйАгент(ВидЦенности) Экспорт
	
	ВидыЦенностейНалоговогоАгента = МассивВидовЦенностиНалоговыйАгент();
	Возврат ВидыЦенностейНалоговогоАгента.Найти(ВидЦенности) <> Неопределено;
	
КонецФункции

// Определяет, относится ли переданный вид ценности к операциям налогового агента по НДС за нерезидента.
// Анализируется только налоговый агент по приобретению, налоговый агент при реализации комиссионных товаров
// или услуг в данной функции не рассматривается.
// Параметры
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
// Возвращаемое значение: 
//     Булево - Истина - вид ценности относится к операциям налогового агента по НДС за нерезидента,
//              Ложь - вид ценности не относится к операциям налогового агента по НДС за нерезидента.
Функция ЭтоНалоговыйАгентЗаНерезидента(ВидЦенности) Экспорт
	
	Если ВидЦенности = Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы
		ИЛИ ВидЦенности = Перечисления.ВидыЦенностей.НалоговыйАгентЭлектронныеУслуги Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает массив видов ценностей, относящихся к операциям налогового агента по НДС.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностиНалоговыйАгент() Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентКомитент);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентРеализацияИмущества);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентЭлектронныеУслуги);
	
	Возврат ВидыЦенностей;
	
КонецФункции

// Возвращает массив видов ценностей, по которым производится поиск счета-фактуры с учетом договора.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностейУчитывающихсяПоДоговорам() Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыВыданные);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученных);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ВидыЦенностей,
		МассивВидовЦенностиНалоговыйАгент());
		
	Возврат ВидыЦенностей;
	
КонецФункции
	
// Определяет, производится ли поиск счета-фактуры по переданному виду ценности с учетом договора.
// Параметры
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
// Возвращаемое значение: 
//     Булево - Истина - вид ценности учитывается по договорам,
//              Ложь - вид ценности не учитывается по договорам.
Функция УчитываетсяПоДоговорам(ВидЦенности) Экспорт
	
	ВидыЦенностейУчитывающиесяПоДоговорам = МассивВидовЦенностейУчитывающихсяПоДоговорам();
	Возврат ВидыЦенностейУчитывающиесяПоДоговорам.Найти(ВидЦенности) <> Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти
